# Logistic Regression

In [1]:
import numpy as np
import pandas as pd

In [2]:
Raw_data=pd.read_csv('Social_Network_Ads.csv')

In [3]:
type(Raw_data)

pandas.core.frame.DataFrame

In [4]:
Raw_data.tail()
Raw_data.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [5]:
Raw_data.shape

(400, 5)

In [6]:
Raw_data.tail(10)

      User ID  Gender  Age  EstimatedSalary  Purchased
390  15807837    Male   48            33000          1
391  15592570    Male   47            23000          1
392  15748589  Female   45            45000          1
393  15635893    Male   60            42000          1
394  15757632  Female   39            59000          0
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

# To Predict the people will buy the stuff or not

In [7]:
cat_to_num=pd.get_dummies(Raw_data.Gender)

In [8]:
cat_to_num.head()

   Female  Male
0       0     1
1       0     1
2       1     0
3       1     0
4       0     1

In [9]:
final_dataset=pd.concat([Raw_data,cat_to_num],axis='columns')

In [10]:
final_dataset

      User ID  Gender  Age  EstimatedSalary  Purchased  Female  Male
0    15624510    Male   19            19000          0       0     1
1    15810944    Male   35            20000          0       0     1
2    15668575  Female   26            43000          0       1     0
3    15603246  Female   27            57000          0       1     0
4    15804002    Male   19            76000          0       0     1
..        ...     ...  ...              ...        ...     ...   ...
395  15691863  Female   46            41000          1       1     0
396  15706071    Male   51            23000          1       0     1
397  15654296  Female   50            20000          1       1     0
398  15755018    Male   36            33000          0       0     1
399  15594041  Female   49            36000          1       1     0

[400 rows x 7 columns]

In [11]:
final_dataset=final_dataset.drop(['Gender','Male'],axis='columns')

In [12]:
final_dataset.head()

    User ID  Age  EstimatedSalary  Purchased  Female
0  15624510   19            19000          0       0
1  15810944   35            20000          0       0
2  15668575   26            43000          0       1
3  15603246   27            57000          0       1
4  15804002   19            76000          0       0

In [13]:
final_dataset.corr()

                  User ID       Age  EstimatedSalary  Purchased    Female
User ID          1.000000 -0.000721         0.071097   0.007120  0.025249
Age             -0.000721  1.000000         0.155238   0.622454  0.073741
EstimatedSalary  0.071097  0.155238         1.000000   0.362083  0.060435
Purchased        0.007120  0.622454         0.362083   1.000000  0.042469
Female           0.025249  0.073741         0.060435   0.042469  1.000000

In [14]:
x=final_dataset.drop(['Purchased'],axis='columns')
print(x.shape)

(400, 4)

In [15]:
y=final_dataset.Purchased
print(y.shape)

(400,)

In [16]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=0)

In [17]:
x_train

      User ID  Age  EstimatedSalary  Female
336  15664907   58           144000       0
64   15605000   59            83000       1
55   15649136   24            55000       1
106  15706185   26            35000       1
300  15736397   58            38000       1
..        ...  ...              ...     ...
323  15619465   48            30000       1
192  15779581   29            43000       0
117  15591433   36            52000       0
47   15776348   27            54000       1
172  15794661   26           118000       1

[320 rows x 4 columns]

In [18]:
x_test

      User ID  Age  EstimatedSalary  Female
132  15725660   30            87000       0
309  15652400   38            50000       1
341  15776844   35            75000       0
196  15738448   30            79000       1
246  15638003   35            50000       1
..        ...  ...              ...     ...
14   15628972   18            82000       0
363  15768293   42            79000       1
304  15598070   40            60000       1
361  15778830   53            34000       1
329  15639576   47           107000       1

[80 rows x 4 columns]

In [19]:
y_train

336    1
64     0
55     0
106    0
300    1
      ..
323    1
192    0
117    0
47     0
172    0
Name: Purchased, Length: 320, dtype: int64

In [20]:
y_test

132    0
309    0
341    0
196    0
246    0
      ..
14     0
363    0
304    0
361    1
329    1
Name: Purchased, Length: 80, dtype: int64

In [21]:
#from sklearn.preprocessing import StandardScaler
#sc=StandardScaler()
#x_train=sc.fit_transform(x_train)
#x_test=sc.fit_transform(x_test)

In [22]:
x_train

      User ID  Age  EstimatedSalary  Female
336  15664907   58           144000       0
64   15605000   59            83000       1
55   15649136   24            55000       1
106  15706185   26            35000       1
300  15736397   58            38000       1
..        ...  ...              ...     ...
323  15619465   48            30000       1
192  15779581   29            43000       0
117  15591433   36            52000       0
47   15776348   27            54000       1
172  15794661   26           118000       1

[320 rows x 4 columns]

In [23]:
from sklearn.linear_model import LogisticRegression
model=LogisticRegression()
cr_model=model.fit(x_train,y_train)

In [24]:
y_pred=cr_model.predict(x_test)

In [25]:
y_pred

array([0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1,
       0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0,
       0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1], dtype=int64)

In [26]:
y_test

132    0
309    0
341    0
196    0
246    0
      ..
14     0
363    0
304    0
361    1
329    1
Name: Purchased, Length: 80, dtype: int64

In [27]:
print(cr_model.predict([[1.46809058, -1.18779381,  1.3927418 ,  0.97530483]]))

[1]

C:\Users\gauta\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LogisticRegression was fitted with feature names
  warnings.warn(

# confusion Matrix

In [28]:
from sklearn.metrics import confusion_matrix
cm=confusion_matrix(y_test,y_pred)
cm

array([[56,  2],
       [12, 10]], dtype=int64)

In [29]:
acc_old=(53+19)/(53+5+3+19)

In [30]:
acc_old

0.9

In [31]:
acc=(56+10)/(56+2+12+10)

In [32]:
acc

0.825